Documents/ИзменениеРежима.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеРежима</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеРегистрацииПоказателей</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияСтационара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСтационара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СколькоРазВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДействия</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИзменениеРежима/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	Если Объект.ДействияСтационара.Количество() = 0 Тогда
		ДатаНачала = Объект.Дата;
	Иначе
		ДатаНачала	  = Объект.ДействияСтационара[0].ДатаНачала;
		ДатаОкончания = Объект.ДействияСтационара[0].ДатаОкончания;
	КонецЕсли;
	
	ПереченьПоказатели = Справочники.ДействияМедсестрыСтационара.ПоказателиЗдоровья003у();
	Для Каждого Показатель Из ПереченьПоказатели Цикл
		СтрокаПоказатель = Показатели.Добавить();
		СтрокаПоказатель.Показатель = Показатель;
		
		СтрокиТабЧасти = Объект.ДействияСтационара.НайтиСтроки(Новый Структура("ДействиеСтационара", Показатель));
		Если СтрокиТабЧасти.Количество() = 0 Тогда
			СтрокаПоказатель.СколькоРазВДень = 2;
			СтрокаПоказатель.ИдентификаторДействия = Новый УникальныйИдентификатор;
			СколькоРазВДень = 2;
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаПоказатель, СтрокиТабЧасти[0]);
			СтрокаПоказатель.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТабЧасти Из Объект.ДействияСтационара Цикл
		Если ПустаяСтрока(СтрокаТабЧасти.ДействиеСтационара.ИмяПредопределенныхДанных) Тогда
			СтрокаТаблицы = ДействияСтационара.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТабЧасти);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	РазВДеньВСпискеПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДействияСтационара.Очистить();
	Для Каждого СтрокаПоказатель Из Показатели Цикл
		Если СтрокаПоказатель.СколькоРазВДень > 0
			И СтрокаПоказатель.Пометка
		Тогда
			СтрокаТабЧасти = Объект.ДействияСтационара.Добавить();
			СтрокаТабЧасти.ДействиеСтационара = СтрокаПоказатель.Показатель;
			СтрокаТабЧасти.Комментарий = СтрокаПоказатель.Комментарий;
			СтрокаТабЧасти.СколькоРазВДень = СтрокаПоказатель.СколькоРазВДень;
			СтрокаТабЧасти.ИдентификаторДействия = СтрокаПоказатель.ИдентификаторДействия;
			СтрокаТабЧасти.ДатаНачала = ДатаНачала;
			СтрокаТабЧасти.ДатаОкончания = ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ДействияСтационара Цикл
		СтрокаТабЧасти = Объект.ДействияСтационара.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПредыдущему(Команда)

	Если ЗначениеЗаполнено(Объект.МедицинскаяКарта) Тогда 
		Объект.ДействияСтационара.Очистить();
		ЗаполнитьПоПредыдущемуНаСервере();
	Иначе 
		ПоказатьПредупреждение(,"Нужно выбрать медицинскую карту!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РазВДеньВСпискеПриИзменении(Элемент)
	
	Если Не РазВДеньВСписке
		И Показатели.Количество() <> 0
	Тогда
		СколькоРазВДень = Показатели[0].СколькоРазВДень;
		
		Для Каждого СтрокаПоказатель Из Показатели Цикл
			СтрокаПоказатель.СколькоРазВДень = СколькоРазВДень;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.СколькоРазВДень.Доступность = Не РазВДеньВСписке;
	Элементы.ПоказателиСколькоРазВДень.Доступность = РазВДеньВСписке;
	
КонецПроцедуры

&НаКлиенте
Процедура СколькоРазВДеньПриИзменении(Элемент)
	
	Для Каждого СтрокаПоказатель Из Показатели Цикл
		СтрокаПоказатель.СколькоРазВДень = СколькоРазВДень;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.ДействияСтационара.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторДействия = Новый УникальныйИдентификатор;
		
		Если Не Копирование Тогда
			ТекущиеДанные.ДатаНачала	 = ДатаНачала;
			ТекущиеДанные.ДатаОкончания	 = ДатаОкончания;
			Если РазВДеньВСписке Тогда
				ТекущиеДанные.СколькоРазВДень = 1;
			Иначе
				ТекущиеДанные.СколькоРазВДень = СколькоРазВДень;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСтационараДатаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДействияСтационара.ТекущиеДанные;
	Если ТекущиеДанные.ДатаНачала > ТекущиеДанные.ДатаОкончания Тогда
		ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ДатаНачала;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоПредыдущемуНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИзменениеРежима.Ссылка КАК Ссылка,
	                      |	ИзменениеРежима.Дата КАК Дата
	                      |ПОМЕСТИТЬ тбСсылки
	                      |ИЗ
	                      |	Документ.ИзменениеРежима КАК ИзменениеРежима
	                      |ГДЕ
	                      |	ИзменениеРежима.МедицинскаяКарта = &МедицинскаяКарта
	                      |	И ИзменениеРежима.Проведен
	                      |	И ИзменениеРежима.Филиал = &Филиал
	                      |	И ИзменениеРежима.Ссылка <> &Ссылка
	                      |	И ИзменениеРежима.Дата <= &Дата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(тбСсылки.Дата) КАК Дата
	                      |ПОМЕСТИТЬ ТбСсылкаБлижайшая
	                      |ИЗ
	                      |	тбСсылки КАК тбСсылки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	тбСсылки.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ТбСсылка
	                      |ИЗ
	                      |	ТбСсылкаБлижайшая КАК ТбСсылкаБлижайшая
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тбСсылки КАК тбСсылки
	                      |		ПО ТбСсылкаБлижайшая.Дата = тбСсылки.Дата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ИзменениеРежимаДействияСтационара.Ссылка КАК Ссылка,
	                      |	ИзменениеРежимаДействияСтационара.НомерСтроки КАК НомерСтроки,
	                      |	ИзменениеРежимаДействияСтационара.ДействиеСтационара КАК ДействиеСтационара,
	                      |	ИзменениеРежимаДействияСтационара.ДатаНачала КАК ДатаНачала,
	                      |	ИзменениеРежимаДействияСтационара.ДатаОкончания КАК ДатаОкончания,
	                      |	ИзменениеРежимаДействияСтационара.СколькоРазВДень КАК СколькоРазВДень,
	                      |	ИзменениеРежимаДействияСтационара.Комментарий КАК Комментарий,
	                      |	ИзменениеРежимаДействияСтационара.ИдентификаторДействия КАК ИдентификаторДействия,
	                      |	ВЫБОР
	                      |		КОГДА ИзменениеРежимаДействияСтационара.ДействиеСтационара.ИмяПредопределенныхДанных <> """"
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК ЭтоПредопределенное
	                      |ИЗ
	                      |	Документ.ИзменениеРежима.ДействияСтационара КАК ИзменениеРежимаДействияСтационара
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТбСсылка КАК тбСсылка
	                      |		ПО ИзменениеРежимаДействияСтационара.Ссылка = тбСсылка.Ссылка");
	Запрос.УстановитьПараметр("МедицинскаяКарта",Объект.МедицинскаяКарта);
	Запрос.УстановитьПараметр("Филиал",Объект.Филиал);
	Запрос.УстановитьПараметр("Ссылка",?(Объект.Ссылка.Пустая(),Документы.ИзменениеРежима.ПустаяСсылка(),Объект.Ссылка));
	Запрос.УстановитьПараметр("Дата", ?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		
		ДействияСтационара.Очистить();
		Для Каждого СтрокаПоказатель Из Показатели Цикл
			СтрокаПоказатель.Пометка = Ложь;
		КонецЦикла;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоПредопределенное Тогда
				СтрокиПоказателей = Показатели.НайтиСтроки(Новый Структура("Показатель", Выборка.ДействиеСтационара));
				Если СтрокиПоказателей.Количество() <> 0 Тогда
					СтрокиПоказателей[0].Пометка = Истина;
					СтрокиПоказателей[0].СколькоРазВДень = Выборка.СколькоРазВДень;
				КонецЕсли;
			Иначе
				СтрокаТаблицы = ДействияСтационара.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
				
				Если СтрокаТаблицы.ДатаНачала < НачалоДня(ТекущаяДата()) Тогда
					СтрокаТаблицы.ДатаНачала = ДатаНачала;
				КонецЕсли;
				Если СтрокаТаблицы.ДатаОкончания < СтрокаТаблицы.ДатаНачала Тогда
					СтрокаТаблицы.ДатаОкончания = ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, СтрокаТаблицы.ДатаНачала);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		РазВДеньВСписке = Истина;
		РазВДень = Неопределено;
		Для Каждого СтрокаПоказатель Из Показатели Цикл
			Если СтрокаПоказатель.Пометка Тогда
				Если РазВДень = Неопределено Тогда
					РазВДень = СтрокаПоказатель.СколькоРазВДень;
				ИначеЕсли РазВДень <> СтрокаПоказатель.СколькоРазВДень Тогда
					РазВДеньВСписке = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если РазВДеньВСписке Тогда
			СколькоРазВДень = РазВДень;
			Для Каждого СтрокаПоказатель Из Показатели Цикл
				СтрокаПоказатель.СколькоРазВДень = РазВДень;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти
